app/controllers/businesses_controller.rb

SELECT * FROM "businesses" WHERE (approved = 'yes')
---
  def index
    @businesses = Business.all

SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
---
  def show
    @business = Business.find(params[:id])

SELECT * FROM "businesses" WHERE ("businesses"."id" = 2)
---
  def edit
    @business = Business.find(params[:id])

INSERT INTO "businesses" ("name", "address", "city", "state", "country", "rating", "review", "category", "description", "zipcode", "yelpid", "created_at", "updated_at", "picture", "url", "referer_reward", "referee_reward", "expiry_date", "referal_program_name", "start_date", "upper_limit", "referee_constraint", "approved") VALUES('blah', NULL, '', '', NULL, NULL, NULL, NULL, 'blah', NULL, NULL, '2009-10-11 05:14:04', '2009-10-11 05:14:04', NULL, '', NULL, NULL, NULL, '', NULL, NULL, NULL, NULL)
---
  def create
    @business = Business.new(params[:business])

    respond_to do |format|
      if @business.save

SELECT * FROM "businesses" WHERE ("businesses"."id" = 6)
UPDATE "businesses" SET "description" = 'Share the best things about being a Sprint customer with your family and friends. Tell friends or family about saving with our family plan, our latest award-winning phones, or how much you love being on the most dependable 3G Network and you could earn up to $600. Refer your friends to Sprint starting 7/12/09 and we''ll reward you $50, and your friends $25 in Sprint Referral Rewards by Visa® debit card for each new line of service activated. You can get up to $600 from 12 new lines before 10/31/2009.', "city" = 'Bellevue', "state" = 'WA', "url" = 'http://www.sprint.com/landings/refrewards/', "referee_reward" = 25, "referer_reward" = 50, "updated_at" = '2009-09-30 21:39:33' WHERE "id" = 6
---
  def update
    @business = Business.find(params[:id])

    respond_to do |format|
      if @business.update_attributes(params[:business])

SELECT * FROM "businesses" WHERE ("businesses"."id" = 1)
DELETE FROM "businesses" WHERE "id" = 1
---
  def destroy
    @business = Business.find(params[:id])
    @business.destroy

SELECT * FROM "businesses" WHERE ("businesses"."id" = 2)
UPDATE "businesses" SET "address" = 'address', "updated_at" = '2009-10-11 05:01:00' WHERE "id" = 2
---
  def approve
    business = Business.find(params[:id])
    business.approved = "yes"
    business.save

SELECT * FROM "businesses" WHERE (name LIKE '%hfoadf%' AND city = '%hfoadf%')
---
  def search
    @businesses = Business.search(params[:businessname])

SELECT * FROM "businesses" WHERE ("businesses"."category" = 'bank')
---
  def category
    @businesses = Business.find_all_by_category(params[:id])