app/controllers/home_controller.rb

  def search
    @businesses = Business.search(params[:businessname])
---
SELECT * FROM "businesses" WHERE (name LIKE '%%' AND approved = 'yes')

  def index
    @hotbusinesses = Business.find(:all, :limit => 4, :conditions => ["referee_reward > ?", 10])
---
SELECT * FROM "businesses" WHERE (name LIKE '%%' AND approved = 'yes')

  def record_contact
    contactrecord = ContactRecord.new(params[:contactrecord])

    # perform validation
    error_id = "error" + contactrecord.business.id.to_s()
    if contactrecord.name.length == 0
      render :update do |page|
        page.replace_html error_id,"tell us your name"
      end
    elsif contactrecord.email.length == 0 && contactrecord.phone.length == 0
      render :update do |page|
        page.replace_html error_id,"leave phone or email"
      end
    elsif (contactrecord.phone.length > 0 && contactrecord.phone.length != 10)
      render :update do |page|
        page.replace_html error_id,"invalid phone number"
      end
    elsif !(contactrecord.email =~ /(.+)@(.+)\.(.{3})/ )
      render :update do |page|
        page.replace_html error_id,"invalid email"
      end
    else
      contactrecord.save
---
SELECT * FROM "contact_records" WHERE ("contact_records"."business_id" = 2) LIMIT 1
INSERT INTO "contact_records" ("business_id", "user_id", "name", "email", "phone", "created_at", "updated_at") VALUES(2, NULL, 'Ji', 'greatjimcom@hotmail.com', '', '2009-10-03 21:18:58', '2009-10-03 21:18:58')

  def category
    @businesses = Business.find_all_by_category(params[:id])
---
SELECT * FROM "businesses" WHERE ("businesses"."category" = 'bank') LIMIT 1