app/controllers/login_controller.rb

  def process_login
    if (userid = User.authenticate(params[:username], params[:password])) != -1
      user = User.find(userid)
---
SELECT * FROM "users" WHERE (displayname = 'Ji' and password = 'yyyyyy')