app/controllers/referals_controller.rb

  def create
    @referal = Referal.new(params[:referal])
    @referal.save!
---
INSERT INTO "referals" ("publishtime", "description", "offerprice", "user_id", "business_id", "created_at", "updated_at") VALUES(NULL, 'asdf', 456, NULL, 2, '2009-09-23 21:02:27', '2009-09-23 21:02:27')

  def remove
    referal = Referal.find(params[:id])
    userid = referal.user.id
    referal.destroy
---
SELECT * FROM "referals" WHERE ("referals"."id" = 2)
DELETE FROM "referals" WHERE "id" = 2