app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT * FROM "requests"

  def create
    @request = Request.new(params[:request])
    @request.business_id = session[:businessid]
    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("publishtime", "description", "askprice", "user_id", "business_id", "created_at", "updated_at") VALUES(NULL, 'blah!', 700, NULL, NULL, '2009-09-23 06:30:11', '2009-09-23 06:30:11')