app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 0)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 8)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("displayname", "email", "ratingcount", "averagerating", "picture", "created_at", "updated_at", "password", "role") VALUES('wesley', 'wesley.adv08@gmail.com', NULL, NULL, NULL, '2009-10-02 20:17:16', '2009-10-02 20:17:16', 'wesley', 'Referer')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 8)
UPDATE "users" SET "password" = '123456', "updated_at" = '2009-10-04 18:44:09' WHERE "id" = 8

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 9)
DELETE FROM "users" WHERE "id" = 9

  def profile
    @user = User.find(params[:id])
    @businesses = Business.all
---
SELECT * FROM "users" WHERE ("users"."id" = 8)
SELECT * FROM "businesses"